In [1]:
#creating a data frame
#meta data should come here

In [2]:
import pandas as pd
data ={'Name':['A','B','C','D','E','F','G','H','I','J'],
      'RollNo':['1','2','3','4','5','6','7','8','9','10'],
      'Gender':['M','M','F','F','M','F','M','F','F','M'],
      'Marks1':['1','2','3','4','5','6','7','8','9','10'],
      'Marks2':['10','9','8','7','6','5','4','3','2','1'],
      'Marks3':['5','6','9','10','2','1','6','10','8','9']
      }
report = pd.DataFrame(data)
print(report)

  Name RollNo Gender Marks1 Marks2 Marks3
0    A      1      M      1     10      5
1    B      2      M      2      9      6
2    C      3      F      3      8      9
3    D      4      F      4      7     10
4    E      5      M      5      6      2
5    F      6      F      6      5      1
6    G      7      M      7      4      6
7    H      8      F      8      3     10
8    I      9      F      9      2      8
9    J     10      M     10      1      9

In [3]:
report[['Marks1','Marks2','Marks3']]=report[['Marks1','Marks2','Marks3']].astype(int)

In [4]:
report['Total'] = report['Marks1']+report['Marks2']+report['Marks3']
report

  Name RollNo Gender  Marks1  Marks2  Marks3  Total
0    A      1      M       1      10       5     16
1    B      2      M       2       9       6     17
2    C      3      F       3       8       9     20
3    D      4      F       4       7      10     21
4    E      5      M       5       6       2     13
5    F      6      F       6       5       1     12
6    G      7      M       7       4       6     17
7    H      8      F       8       3      10     21
8    I      9      F       9       2       8     19
9    J     10      M      10       1       9     20

In [5]:
lowestMarks1 =  report.sort_values("Marks1",ascending = True)
lowestMarks1[0:1]

  Name RollNo Gender  Marks1  Marks2  Marks3  Total
0    A      1      M       1      10       5     16

In [6]:
# student A got the lowest marks in marks 1

In [7]:
highestMarks2 =  report.sort_values("Marks2",ascending = False)
highestMarks2[0:1]

  Name RollNo Gender  Marks1  Marks2  Marks3  Total
0    A      1      M       1      10       5     16

In [8]:
# student A got the highest marks in marks 2

In [9]:
report["Marks3"].mean()

6.6

In [10]:
# average marks in marks 3 is 6.6

In [11]:
highestAvg = report.sort_values("Total",ascending = False)
highestAvg

  Name RollNo Gender  Marks1  Marks2  Marks3  Total
3    D      4      F       4       7      10     21
7    H      8      F       8       3      10     21
2    C      3      F       3       8       9     20
9    J     10      M      10       1       9     20
8    I      9      F       9       2       8     19
1    B      2      M       2       9       6     17
6    G      7      M       7       4       6     17
0    A      1      M       1      10       5     16
4    E      5      M       5       6       2     13
5    F      6      F       6       5       1     12

In [12]:
highestAvg[0:2]

  Name RollNo Gender  Marks1  Marks2  Marks3  Total
3    D      4      F       4       7      10     21
7    H      8      F       8       3      10     21

In [13]:
# the two students with the higest average are D AND H

In [19]:
len
#r = report[report["Marks2"]<4]
#len(r)

3

In [15]:
#hence students H I and J failed in Marks 2 as the got a score below 40%